PastPapers/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.all