PastPapers/app/controllers/home_controller.rb

  def index
    if session[:user_id] != nil
      @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]