PastPapers/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    #Save the user
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["email", "stefi@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-02-03 12:27:32.529535"], ["updated_at", "2024-02-03 12:27:32.529535"]]

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]